Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8C.xml
        <register name="LOCKS" offset="0x1A4" rw="W" size="4" caption="Lock Register - Set">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="LOCKC" offset="0x1A8" rw="W" size="4" caption="Lock Register - Clear">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="LOCKT" offset="0x1AC" rw="W" size="4" caption="Lock Register - Toggle">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="UNLOCK" offset="0x1E0" rw="W" size="4" caption="Unlock Register">
          <bitfield name="ADDR" caption="Offset Register" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlocking Key" mask="0xFF000000"/>
        </register>
        <register name="ASR" offset="0x1E4" rw="RW" size="4" caption="Access Status Register">
          <bitfield name="AR" caption="Access Error" mask="0x1"/>
        </register>
