Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8C.xml
        <register name="PBBMASK" offset="0x2c" rw="RW" size="4" initval="0x00000001" caption="PBB Mask">
          <bitfield name="HFLASHC_" caption="HFLASHC APB Clock Enable" mask="0x1"/>
          <bitfield name="HCACHE_" caption="HCACHE APB Clock Enable" mask="0x2"/>
          <bitfield name="HMATRIX_" caption="HMATRIX APB Clock Enable" mask="0x4"/>
          <bitfield name="PDCA_" caption="PDCA APB Clock Enable" mask="0x8"/>
          <bitfield name="CRCCU_" caption="CRCCU APB Clock Enable" mask="0x10"/>
          <bitfield name="USBC_" caption="USBC APB Clock Enable" mask="0x20"/>
          <bitfield name="PEVC_" caption="PEVC APB Clock Enable" mask="0x40"/>
        </register>
        <register name="PBCMASK" offset="0x30" rw="RW" size="4" initval="0x0000001F" caption="PBC Mask">
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x1"/>
          <bitfield name="CHIPID_" caption="CHIPID APB Clock Enable" mask="0x2"/>
          <bitfield name="SCIF_" caption="SCIF APB Clock Enable" mask="0x4"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x8"/>
          <bitfield name="GPIO_" caption="GPIO APB Clock Enable" mask="0x10"/>
        </register>
        <register name="PBDMASK" offset="0x34" rw="RW" size="4" initval="0x0000003F" caption="PBD Mask">
          <bitfield name="BPM_" caption="BPM APB Clock Enable" mask="0x1"/>
          <bitfield name="BSCIF_" caption="BSCIF APB Clock Enable" mask="0x2"/>
          <bitfield name="AST_" caption="AST APB Clock Enable" mask="0x4"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x8"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x10"/>
          <bitfield name="PICOUART_" caption="PICOUART APB Clock Enable" mask="0x20"/>
        </register>
        <register name="PBADIVMASK" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="PBA Divided Clock Mask">
        </register>
        <register name="CFDCTRL" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detection Enable" mask="0x1"/>
          <bitfield name="SFV" caption="Store Final Value" mask="0x80000000"/>
        </register>
        <register name="UNLOCK" offset="0x58" rw="W" size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
        <register name="IER" offset="0xc0" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Enable" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Enable" mask="0x100" values="PM_IER__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0xc4" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Disable" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Disable" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Disable" mask="0x100" values="PM_IDR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Disable" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0xc8" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Mask" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Mask" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Mask" mask="0x100" values="PM_IMR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Mask" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xcc" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Status" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Status" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Status" mask="0x100" values="PM_ISR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Status" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0xd0" rw="W" size="4" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Status Clear" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Status Clear" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Status Clear" mask="0x100"/>
          <bitfield name="AE" caption="Access Error Interrupt Status Clear" mask="0x80000000"/>
        </register>
        <register name="SR" offset="0xd4" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="CFD" caption="Clock Failure Detected" mask="0x1"/>
          <bitfield name="OCP" caption="Over Clock Detected" mask="0x2"/>
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up" mask="0x100" values="PM_SR__WAKE"/>
          <bitfield name="PERRDY" caption="Peripheral Ready" mask="0x10000000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PPCR" offset="0x160" rw="RW" size="4" initval="0x000001FE" caption="Peripheral Power Control Register">
          <bitfield name="RSTPUN" caption="Reset Pullup" mask="0x1"/>
          <bitfield name="CATBRCMASK" caption="CAT Request Clock Mask" mask="0x2"/>
          <bitfield name="ACIFCRCMASK" caption="ACIFC Request Clock Mask" mask="0x4"/>
          <bitfield name="ASTRCMASK" caption="AST Request Clock Mask" mask="0x8"/>
          <bitfield name="TWIS0RCMASK" caption="TWIS0 Request Clock Mask" mask="0x10"/>
          <bitfield name="TWIS1RCMASK" caption="TWIS1 Request Clock Mask" mask="0x20"/>
          <bitfield name="PEVCRCMASK" caption="PEVC Request Clock Mask" mask="0x40"/>
          <bitfield name="ADCIFERCMASK" caption="ADCIFE Request Clock Mask" mask="0x80"/>
          <bitfield name="VREGRCMASK" caption="VREG Request Clock Mask" mask="0x100"/>
          <bitfield name="FWBGREF" caption="Flash Wait BGREF" mask="0x200"/>
          <bitfield name="FWBOD18" caption="Flash Wait BOD18" mask="0x400"/>
        </register>
        <register name="RCAUSE" offset="0x180" rw="R" size="4" initval="0x00000000" caption="Reset Cause Register">
          <bitfield name="POR" caption="Power-on Reset" mask="0x1"/>
          <bitfield name="BOD" caption="Brown-out Reset" mask="0x2"/>
          <bitfield name="EXT" caption="External Reset Pin" mask="0x4"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x8"/>
          <bitfield name="OCDRST" caption="OCD Reset" mask="0x100"/>
          <bitfield name="POR33" caption="Power-on Reset" mask="0x400"/>
          <bitfield name="BOD33" caption="Brown-out 3.3V Reset" mask="0x2000"/>
        </register>
        <register name="WCAUSE" offset="0x184" rw="R" size="4" initval="0x00000000" caption="Wake Cause Register">
          <bitfield name="TWI_SLAVE_0" caption="Two-wire Slave Interface 0" mask="0x1"/>
          <bitfield name="TWI_SLAVE_1" caption="Two-wire Slave Interface 1" mask="0x2"/>
          <bitfield name="USBC" caption="USB Device and Embedded Host Interface" mask="0x4"/>
          <bitfield name="PSOK" caption="Power Scaling OK" mask="0x8"/>
          <bitfield name="BOD18_IRQ" caption="BOD18 Interrupt" mask="0x10"/>
          <bitfield name="BOD33_IRQ" caption="BOD33 Interrupt" mask="0x20"/>
          <bitfield name="PICOUART" caption="Picopower UART" mask="0x40"/>
          <bitfield name="LCDCA" caption="LCD Controller" mask="0x80"/>
          <bitfield name="EIC" caption="External Interrupt Controller" mask="0x10000"/>
          <bitfield name="AST" caption="Asynchronous Timer" mask="0x20000"/>
        </register>
